# GetBuildingConstructionSetElementId Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyDataSettings..::..GetBuildingConstructionSetElementId Method
EnergyDataSettings Class See Also
---
Id of the building construction set.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public static ElementId GetBuildingConstructionSetElementId(
	Document ccda
)
```

Visual Basic
---
```text
Public Shared Function GetBuildingConstructionSetElementId ( _
	ccda As Document _
) As ElementId
```

Visual C++
---
```text
public:
static ElementId^ GetBuildingConstructionSetElementId(
	Document^ ccda
)
```

# ### Parameters
ccda
    Type: Autodesk.Revit.DB..::..Document
# ### Return Value
Returns the id of the building construction set.
# Remarks
The building construction set is the default project construction set used when spaces are not assigned a construction.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace